import { Metadata } from 'next';
import { SectionHeader } from '../../components/sectionHeader/sectionHeader';
import styles from './styles.module.css';

const title = 'سياسة الخصوصية';
const description = 'سياسة الخصوصية';

export const metadata: Metadata = {
  title: title,
  description: description,
  metadataBase: new URL('https://aljazara.com'),

  openGraph: {
    title: title,
    description: description,
    url: 'https://aljazara.com',
    images: ['/ss-aljazara.png'],
  },
  alternates: {
    canonical: 'https://aljazara.com/privacy',
  },
};

export default async function Page() {
  return (
    <main className={styles.main}>
      <SectionHeader title={'سياسة الخصوصية'} />

      <div className={styles.content}>
        <p>
          نقدر في موقع الجزرة نيوز أهمية الخصوصية وسياستها في حماية البيانات الشخصية في العصر الرقمي. ولذلك نحن ملتزمون بحماية خصوصية مستخدمي وزوار
          موقع الجزرة نيوز من جميع أنحاء العالم أثناء تصفح الموقع الالكتروني.{' '}
        </p>
        <br />
        <p>
          تنطبق سياسة الخصوصية على جميع أقسام وصفحات موقعنا الإلكتروني، ويمكن أيضا إرسال إشعارات أخرى تسلط الضوء على استخدامات معينة نرغب إجراءها على
          بياناتك الشخصية بالإضافة إلى إمكانية الاشتراك أو إلغاء استخدامات محددة على أساس كل حالة على حدة، بما في ذلك الخدمات الجديدة أو خدمات أخرى قد
          يكون لها سياسة خصوصية خاصة بها.
        </p>
        <br />
        <h1>ما هي المعلومات التي نجمعها</h1>
        <ul>
          <li>
            عنوان بريدكم الالكتروني، إضافة إلى المعلومات الأخرى (مثلا اسم المستخدم والعنوان ومكان الإقامة ورقم الهاتف) التي يطلب منكم تقديمها أو التي
            تختارون تقديمها لنا في حال قررتم الاتصال بنا من خلال نموذج الاتصال والمراسلة
          </li>
          <li>المعلومات المستحصلة من خلال استخدام ملفات تعريف الارتباط “cookies” الموجودة على حاسوبكم أو جهازكم</li>
          <li>أي معلومات عنكم، تختارون الكشف عنها عند ترك تعليقاتكم على صفحات موقع الجزرة نيوز</li>
          <li>المعلومات الشخصية التي تصبح متاحة لنا عندما تطلعون على موادنا أو تستخدمون منصات أخرى (مثلا مواقع التواصل الاجتماعي)</li>
          <li>
            عنوان بروتوكول الانترنت (IP) لكم، إضافة إلى المعلومات عن متصفحكم ونوع نظام التشغيل ونوع جهازكم النقال الذي تستخدمونه للاطلاع على موقعنا
          </li>
          <li>معلومات التعريف غير الشخصية التي تجمعها الجهات الثالثة أثناء جمعها الإحصاءات عن سلوك المستخدمين لموقعنا</li>
        </ul>
        <br />
        <h1>مدة حفظ البيانات</h1>
        <p>
          نقوم بحفظ بيانتكم الشخصية فقط للمدة الضرورية لتحقيق الغرض الذي تم الحصول عليها من أجله أو المدة التي نكون ملتزمين قانونيا بحفظ البيانات
          خلالها. وما أن يتحقق الغرض المحدد لحفظ البيانات سيتم حذفها بالكامل.
        </p>
      </div>
    </main>
  );
}
